app/views/lessons/_tri_cal.html.erb

SELECT "classrooms".* FROM "classrooms"  WHERE "classrooms"."name" = 'Test A '
---
            <div class='lessonBlock'>
              <strong><%= link_to lesson.title, lesson, style: "color: #{Classroom.where(name: lesson.location)[0].color}" %></strong><br>