app/controllers/classrooms_controller.rb

SELECT "classrooms".* FROM "classrooms"   ORDER BY max_occupancy DESC
---
  def index
    #determine ordering of classrooms
    sort = params[:sort] || session[:sort]
    case sort
    when 'name'
      ordering = :name
    when 'occupancy'
      ordering = 'max_occupancy DESC'
    end

    if params[:sort] != session[:sort]
      session[:sort] = sort
    end
    @classrooms = Classroom.all.order(ordering)

INSERT INTO "classrooms" ("color", "created_at", "details", "max_occupancy", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["color", "olive"], ["created_at", "2014-12-02 21:28:46.674650"], ["details", ""], ["max_occupancy", 4], ["name", "hi"], ["updated_at", "2014-12-02 21:28:46.674650"]]
---
  def create
    @classroom = Classroom.new(classroom_params)

    respond_to do |format|
      if @classroom.save

UPDATE "classrooms" SET "color" = ?, "updated_at" = ? WHERE "classrooms"."id" = 1  [["color", "dark red"], ["updated_at", "2014-12-02 20:17:53.079200"]]
---
  def update
    respond_to do |format|
      if @classroom.update(classroom_params)

DELETE FROM "classrooms" WHERE "classrooms"."id" = ?  [["id", 5]]
---
  def destroy
    @classroom.destroy

SELECT "classrooms".* FROM "classrooms"
---
      @end_time = Time.now
    end

    @classrooms = Classroom.all