app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all

    @lessons13 = Lesson.where(g1_3: true)
    @lessons35 = Lesson.where(g3_5: true)
    @lessons68 = Lesson.where(g6_8: true)
---
SELECT "lessons".* FROM "lessons"
SELECT "lessons".* FROM "lessons"  WHERE "lessons"."g1_3" = 't'
SELECT "lessons".* FROM "lessons"  WHERE "lessons"."g3_5" = 't'
SELECT "lessons".* FROM "lessons"  WHERE "lessons"."g6_8" = 't'

  def new
    @lesson = Lesson.new

    #generate list of classrooms to select from for location
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

  def edit
    #generate list of   classrooms to select from for location
    @classrooms = Classroom.all
---
SELECT "classrooms".* FROM "classrooms"

  def create
    @lesson = Lesson.new(lesson_params)

    #generate list of classrooms to select from for location
    @classrooms = Classroom.all
    @roomsList = [[]]
    @colorsList = [[]]
    @classrooms.each do |classroom|
      @roomsList << [classroom.name]
      @colorsList << [classroom.color]
    end
    @classroomSelect = @roomsList
    @classroomsColorSelect = @colorsList


    respond_to do |format|
      if @lesson.save
---
SELECT "classrooms".* FROM "classrooms"
INSERT INTO "lessons" ("created_at", "description", "end_date", "ends_at", "fri", "g1_3", "g3_5", "g6_8", "instructor", "location", "max_enrollment", "mon", "start_date", "starts_at", "thu", "title", "tue", "updated_at", "wed") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    #generate list of classrooms to select from for location
    @classrooms = Classroom.all
    @roomsList = [[]]
    @colorsList = [[]]
    @classrooms.each do |classroom|
      @roomsList << [classroom.name]
      @colorsList << [classroom.color]
    end
    @classroomSelect = @roomsList
    @classroomsColorSelect = @colorsList


    respond_to do |format|
      if @lesson.update(lesson_params)
---
SELECT "classrooms".* FROM "classrooms"
UPDATE "lessons" SET "ends_at" = ?, "starts_at" = ?, "title" = ?, "updated_at" = ? WHERE "lessons"."id" = 10  [["ends_at", "1970-01-01 09:01:00.000000"], ["starts_at", "1970-01-01 06:04:00.000000"], ["title", "P.E."], ["updated_at", "2014-12-03 13:43:55.669296"]]